app/views/slideshows/edit.html.erb

SELECT "pictures".* FROM "pictures" INNER JOIN "slideshowpictures" ON "pictures"."id" = "slideshowpictures"."picture_id" WHERE "slideshowpictures"."slideshow_id" = ?  [["slideshow_id", 10]]
---
				<h2>In your slideshow</h2>
				<% @slideshow.pictures.each do |p| %>