app/views/slideshows/index.html.erb

		<br>
		<% s.pictures.each do |p| %>
---
SELECT "pictures".* FROM "pictures" INNER JOIN "slideshowpictures" ON "pictures"."id" = "slideshowpictures"."picture_id" WHERE "slideshowpictures"."slideshow_id" = ?  [["slideshow_id", 9]]