app/views/slave/play.html.erb

            <div class="item active">
                <img src="<%= @slideshow.pictures.first.avatar %>" alt="...">
---
SELECT "pictures".* FROM "pictures" INNER JOIN "slideshowpictures" ON "pictures"."id" = "slideshowpictures"."picture_id" WHERE "slideshowpictures"."slideshow_id" = ? ORDER BY "pictures"."id" ASC LIMIT 1  [["slideshow_id", 9]]