app/controllers/master_controller.rb

  def pictures
    @picture = Picture.all
---
SELECT "pictures".* FROM "pictures"

  def create
    @picture = Picture.new picture_params
    if @picture.save
---
INSERT INTO "pictures" ("avatar", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["avatar", "Black.jpg"], ["created_at", Tue, 03 Jun 2014 23:12:35 UTC +00:00], ["updated_at", Tue, 03 Jun 2014 23:12:35 UTC +00:00], ["user_id", 1]]

  def slideshows
    @pictures = current_user.pictures.all
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ?  [["user_id", 1]]

  def slideshowcreate
      if current_user.slideshows.create(slideshow_params)
---
INSERT INTO "slideshows" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 06 Jul 2014 20:00:26 UTC +00:00], ["name", ""], ["updated_at", Sun, 06 Jul 2014 20:00:26 UTC +00:00], ["user_id", 1]]