app/controllers/pictures_controller.rb

  def index
    @pictures = current_user.pictures.all
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ?  [["user_id", 7]]

  def create
    if params[:images].nil?
      flash[:notice] = "Error: Please select a picture to upload!"
      redirect_to user_pictures_path current_user
    else
      params[:images].each do |img|
        User.find(params[:user_id]).pictures.create(:avatar => img[:avatar])
---
INSERT INTO "pictures" ("avatar", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["avatar", "lilacs.jpg"], ["created_at", Sun, 13 Jul 2014 18:12:24 UTC +00:00], ["name", "dude"], ["updated_at", Sun, 13 Jul 2014 18:12:24 UTC +00:00], ["user_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]

  def destroy
    params[:delete_ids].each do |id|
      Picture.find(id).destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 20]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "20"]]