app/controllers/slave_controller.rb

SELECT "slideshows".* FROM "slideshows" WHERE "slideshows"."id" = ? LIMIT 1  [["id", "8"]]
---
  def play
  	@user = current_user
  	@slideshow = Slideshow.find(params[:id])