app/controllers/slideshows_controller.rb

  def index
    @slideshows = current_user.slideshows.all
---
SELECT "slideshows".* FROM "slideshows" WHERE "slideshows"."user_id" = ?  [["user_id", 7]]

  def new
    @pictures = current_user.pictures.all
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ?  [["user_id", 7]]

  def create
    if current_user.slideshows.create(slideshow_params)
---
INSERT INTO "slideshows" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 13 Jul 2014 17:23:16 UTC +00:00], ["name", ""], ["updated_at", Sun, 13 Jul 2014 17:23:16 UTC +00:00], ["user_id", 7]]

  def edit
    @slideshow = Slideshow.find(params[:id])
    @pictures = current_user.pictures.all - @slideshow.pictures
---
SELECT "slideshows".* FROM "slideshows" WHERE "slideshows"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "pictures".* FROM "pictures" INNER JOIN "slideshowpictures" ON "pictures"."id" = "slideshowpictures"."picture_id" WHERE "slideshowpictures"."slideshow_id" = ?  [["slideshow_id", 10]]