app/controllers/users_controller.rb

  def create #restful route to make new user!
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "last_name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)